In [3]:
import pandas as pd ## df
import matplotlib.pyplot as plt ## 시각화
import numpy as np ## 수학적인 처리 함수
import seaborn as sns ## 다양한 데이터셋과 시각화 함수

In [4]:
 # 1. df로 읽어들이고
df = pd.read_csv("scientists.csv", encoding="utf8")
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Computer Scientist
2  Florence Nightingale  1820-05-12  1910-08-13   90  Computer Scientist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [5]:
# 2. df의 전체 데이터셋 타입을 확인
df.dtypes

Name          object
Born          object
Died          object
Age            int64
Occupation    object
dtype: object

In [6]:
# 3. df의 컬럼리스트를 확인
df.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [7]:
# 4. df의 값을 확인
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Computer Scientist
2  Florence Nightingale  1820-05-12  1910-08-13   90  Computer Scientist
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [9]:
# 5. df의 맨 마지막에 price항목을 추가(값은 임의대로 넣음. int)
df['price']  = range(1, 9) # = 10,  range(1, 9) ==> [1,2,3,4,5,6,7,8]
df['price']

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
Name: price, dtype: int64

In [10]:
# 6. df의 맨 마지막에 percent항목을 추가(값의 임의대로 넣음. float)
df['percent'] = 0.5
df

,Name,Born,Died,Age,Occupation,price,percent
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1,0.5
1,William Gosset,1876-06-13,1937-10-16,61,Computer Scientist,2,0.5
2,Florence Nightingale,1820-05-12,1910-08-13,90,Computer Scientist,3,0.5
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,4,0.5
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,5,0.5
5,John Snow,1813-03-15,1858-06-16,45,Physician,6,0.5
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,7,0.5
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,8,0.5

In [ ]:
# 11. df의 Name컬럼 중 3~5사이의 행 추출
df[조건][]

In [11]:
# 8. df의 Name컬럼 추출
df['Name']

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [13]:
# 9. df의 인덱스 확인
df.index

RangeIndex(start=0, stop=8, step=1)

In [15]:
# 10. df의 Name컬럼의 값이 Rosaline인 행 추출
# df[조건][열][행]
df[ df['Name'] == 'Rosaline Franklin' ]

                Name        Born        Died  Age Occupation  price  percent
0  Rosaline Franklin  1920-07-25  1958-04-16   37    Chemist      1      0.5

In [16]:
# 11. df의 Name컬럼 중 3~5사이의 행 추출
df['Name'][3:6]

3      Marie Curie
4    Rachel Carson
5        John Snow
Name: Name, dtype: object

In [17]:
# 12. df의 Name, Died컬럼 모든 행 추출
df[['Name', 'Died']]

                   Name        Died
0     Rosaline Franklin  1958-04-16
1        William Gosset  1937-10-16
2  Florence Nightingale  1910-08-13
3           Marie Curie  1934-07-04
4         Rachel Carson  1964-04-14
5             John Snow  1858-06-16
6           Alan Turing  1954-06-07
7          Johann Gauss  1855-02-23

In [20]:
# 13. df의 Born컬럼부터 끝컬럼까지 모든 행 추출
# df.loc[행, 열]
df.loc[:, 'Born':]

         Born        Died  Age          Occupation  price  percent
0  1920-07-25  1958-04-16   37             Chemist      1      0.5
1  1876-06-13  1937-10-16   61  Computer Scientist      2      0.5
2  1820-05-12  1910-08-13   90  Computer Scientist      3      0.5
3  1867-11-07  1934-07-04   66             Chemist      4      0.5
4  1907-05-27  1964-04-14   56           Biologist      5      0.5
5  1813-03-15  1858-06-16   45           Physician      6      0.5
6  1912-06-23  1954-06-07   41  Computer Scientist      7      0.5
7  1777-04-30  1855-02-23   77       Mathematician      8      0.5

In [21]:
# 14. df의 Born, Age컬럼의 5~7행 추출
df[['Born', 'Age']][5:8]

         Born  Age
5  1813-03-15   45
6  1912-06-23   41
7  1777-04-30   77

In [22]:
# 15. df.shape을 통해 몇행 몇열인지 확인해보세요.
df.shape

(8, 7)

In [23]:
# 16. df의 숫자 데이터의 상세정보 확인
df.describe()

             Age    price  percent
count   8.000000  8.00000      8.0
mean   59.125000  4.50000      0.5
std    18.325918  2.44949      0.0
min    37.000000  1.00000      0.5
25%    44.000000  2.75000      0.5
50%    58.500000  4.50000      0.5
75%    68.750000  6.25000      0.5
max    90.000000  8.00000      0.5

In [27]:
# 17. Physician라는 스트링 추출(index와 컬럼명을 사용)
df['Occupation'][5]
# df.loc[5, 'Occupation'] # df.loc[행번호, 컬럼이름]

'Physician'

In [25]:
# 18. Alan Turing이라는 스트링 추출(index와 컬럼명을 사용)
df

,Name,Born,Died,Age,Occupation,price,percent
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1,0.5
1,William Gosset,1876-06-13,1937-10-16,61,Computer Scientist,2,0.5
2,Florence Nightingale,1820-05-12,1910-08-13,90,Computer Scientist,3,0.5
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,4,0.5
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,5,0.5
5,John Snow,1813-03-15,1858-06-16,45,Physician,6,0.5
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,7,0.5
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,8,0.5

In [26]:
df['Name'][6]

'Alan Turing'